In [2]:
import pandas as pd

In [5]:
data = [['a',10],['b',20],['c',30]]
print(data)

[['a', 10], ['b', 20], ['c', 30]]

In [8]:
df = pd.DataFrame(data, columns=['name','age'])
print(df)

  name  age
0    a   10
1    b   20
2    c   30

In [12]:
df = pd.read_csv('data.csv' ,sep = '\t')
print(df)

  name  age
0   a     1
1    b    2
2    c    3

In [13]:
df['name']

0    a
1     b
2     c
Name: name, dtype: object

In [14]:
df['age'] #열 기준 출력

0    1
1    2
2    3
Name: age, dtype: int64

In [15]:
df .loc[0] #행 기준 출력

name    a
age      1
Name: 0, dtype: object

In [16]:
df .loc[1]

name    b
age     2
Name: 1, dtype: object

In [17]:
df

  name  age
0   a     1
1    b    2
2    c    3

In [36]:
df['score'] = [4,5,6]

In [37]:
df

  name  age  score
0   a     1      4
1    b    2      5
2    c    3      6

In [38]:
df_remove_score = df .drop('score' ,axis = 1)
df .drop('score' ,axis = 1 ,inplace = True)

In [39]:
df

  name  age
0   a     1
1    b    2
2    c    3

In [28]:
data = [1,2,3]
s = pd.Series(data,index=["a","b","c"])

In [29]:
s

a    1
b    2
c    3
dtype: int64

In [31]:
data = {'a':1, 'b':2,'c':3}
s = pd.Series(data)
s

a    1
b    2
c    3
dtype: int64

In [42]:
df = pd.read_csv('data2.csv')
df

    이름  나이  도시
0  김철수  30  서울
1  이영희  25  서울
2  박상현  40  대전
3  최지우  28  서울
4  정민수  35  세종
5  김민지  22  대전
6  장동건  45  서울
7  한가인  32  세종
8  강감찬  50  대전
9  이순신  27  대전

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      10 non-null     object
 1   나이      10 non-null     int64
 2   도시      10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

In [46]:
df.head(3)

    이름  나이  도시
0  김철수  30  서울
1  이영희  25  서울
2  박상현  40  대전

In [45]:
df.describe()

              나이
count  10.000000
mean   33.400000
std     9.070097
min    22.000000
25%    27.250000
50%    31.000000
75%    38.750000
max    50.000000

In [47]:
df['이름']

0    김철수
1    이영희
2    박상현
3    최지우
4    정민수
5    김민지
6    장동건
7    한가인
8    강감찬
9    이순신
Name: 이름, dtype: object

In [48]:
df[['이름','도시']]

    이름  도시
0  김철수  서울
1  이영희  서울
2  박상현  대전
3  최지우  서울
4  정민수  세종
5  김민지  대전
6  장동건  서울
7  한가인  세종
8  강감찬  대전
9  이순신  대전

In [49]:
df.loc[2]

이름    박상현
나이     40
도시     대전
Name: 2, dtype: object

In [51]:
df.loc[[2,4,5,6]]

    이름  나이  도시
2  박상현  40  대전
4  정민수  35  세종
5  김민지  22  대전
6  장동건  45  서울

In [57]:
df[(df['나이'] < 30) & (df['도시'] == '대전')]

    이름  나이  도시
5  김민지  22  대전
9  이순신  27  대전

In [59]:
df[(df['나이'] < 30) | (df['도시'] == '대전')]

    이름  나이  도시
1  이영희  25  서울
2  박상현  40  대전
3  최지우  28  서울
5  김민지  22  대전
8  강감찬  50  대전
9  이순신  27  대전

In [61]:
df[df['도시'].isin(['대전','세종'])]

    이름  나이  도시
2  박상현  40  대전
4  정민수  35  세종
5  김민지  22  대전
7  한가인  32  세종
8  강감찬  50  대전
9  이순신  27  대전

In [63]:
g = df.groupby('도시')
g.count()

    이름  나이
도시
대전   4   4
서울   4   4
세종   2   2

In [64]:
g.sum()

              이름   나이
도시
대전  박상현김민지강감찬이순신  139
서울  김철수이영희최지우장동건  128
세종        정민수한가인   67

In [67]:
g['나이'].mean()

도시
대전    34.75
서울    32.00
세종    33.50
Name: 나이, dtype: float64

In [68]:
df.sort_values('나이')

    이름  나이  도시
5  김민지  22  대전
1  이영희  25  서울
9  이순신  27  대전
3  최지우  28  서울
0  김철수  30  서울
7  한가인  32  세종
4  정민수  35  세종
2  박상현  40  대전
6  장동건  45  서울
8  강감찬  50  대전

In [69]:
df.sort_values('나이',ascending=False)

    이름  나이  도시
8  강감찬  50  대전
6  장동건  45  서울
2  박상현  40  대전
4  정민수  35  세종
7  한가인  32  세종
0  김철수  30  서울
3  최지우  28  서울
9  이순신  27  대전
1  이영희  25  서울
5  김민지  22  대전

In [70]:
df

    이름  나이  도시
0  김철수  30  서울
1  이영희  25  서울
2  박상현  40  대전
3  최지우  28  서울
4  정민수  35  세종
5  김민지  22  대전
6  장동건  45  서울
7  한가인  32  세종
8  강감찬  50  대전
9  이순신  27  대전

In [71]:
df.reset_index()

   index   이름  나이  도시
0      0  김철수  30  서울
1      1  이영희  25  서울
2      2  박상현  40  대전
3      3  최지우  28  서울
4      4  정민수  35  세종
5      5  김민지  22  대전
6      6  장동건  45  서울
7      7  한가인  32  세종
8      8  강감찬  50  대전
9      9  이순신  27  대전

In [72]:
a = "1"

In [78]:
10/a
print("Hello World")

TypeError: unsupported operand type(s) for /: 'int' and 'str'

In [77]:
try:
    a = "1"
    print(10/a)
except:
    print("Error")
print("Hello World")

Error
Hello World

In [ ]:
try:
    a = 0

In [79]:
a = 0
10/a

ZeroDivisionError: division by zero

In [81]:
try:
    a = " How to go to home"
    print(a)
except:
    b = "You don't go home"
    print(b)

c = "Meow"
print(c)

 How to go to home
Meow

In [91]:
try:
    a = "0"
    print(10/a)
except ZeroDivisionError as e:
    a = 1
    print(e)
    print(10/a)
    
except:
    print("Error")

Error

In [87]:
list("python")

['p', 'y', 't', 'h', 'o', 'n']

In [94]:
a = 3
pow(a,3)

27

In [95]:
sorted([3,1,2])

[1, 2, 3]

In [113]:
#### 문제1

array = [1,4,5,7,8,9,12,15]

In [101]:
d = array / 2
print(d)

TypeError: unsupported operand type(s) for /: 'list' and 'int'

In [106]:
for i in array:

    if i%2 == 1:
        print(i)
        (

1
5
7
9
15

In [116]:
sum = 0
for i in array:
    if i % 2 == 1:
        sum += i
print("합은",sum)

합은 37

In [ ]:
#### 문제 2
다음 문자열 내에서 주어진 문자열 인덱스에 해당하는 문자를 차례로 조합해 단어를 완성하시오.

In [124]:
string = "zpiaz"
index_list = [1,2,0,0,3]

In [122]:
string[1]

'p'

In [129]:
string = "zpiaz"
index_list = [1,2,0,0,3,1,1,1,1,1,1,1,1,1,1]
sum = ""
for i in index_list:
    print(string[i])
    sum+= string[i]
print(sum)

p
i
z
z
a
pizza

In [135]:
index_list = [1,2,0,0,3]
sum = ""
sum += string[1]
sum += string[2]
sum += string[0]
sum += string[0]
sum += string[3]
print(sum)

pizza

In [162]:
###문제 3
sum = [2,3,4,5,6,7,8,9]
list = [1,2,3,4,5,6,7,8,9]
for i in sum:
    #print(i)
    for u in list:
        #print(u)
        print(i, "x", u, "=", i*u)

2 x 1 = 2
2 x 2 = 4
2 x 3 = 6
2 x 4 = 8
2 x 5 = 10
2 x 6 = 12
2 x 7 = 14
2 x 8 = 16
2 x 9 = 18
3 x 1 = 3
3 x 2 = 6
3 x 3 = 9
3 x 4 = 12
3 x 5 = 15
3 x 6 = 18
3 x 7 = 21
3 x 8 = 24
3 x 9 = 27
4 x 1 = 4
4 x 2 = 8
4 x 3 = 12
4 x 4 = 16
4 x 5 = 20
4 x 6 = 24
4 x 7 = 28
4 x 8 = 32
4 x 9 = 36
5 x 1 = 5
5 x 2 = 10
5 x 3 = 15
5 x 4 = 20
5 x 5 = 25
5 x 6 = 30
5 x 7 = 35
5 x 8 = 40
5 x 9 = 45
6 x 1 = 6
6 x 2 = 12
6 x 3 = 18
6 x 4 = 24
6 x 5 = 30
6 x 6 = 36
6 x 7 = 42
6 x 8 = 48
6 x 9 = 54
7 x 1 = 7
7 x 2 = 14
7 x 3 = 21
7 x 4 = 28
7 x 5 = 35
7 x 6 = 42
7 x 7 = 49
7 x 8 = 56
7 x 9 = 63
8 x 1 = 8
8 x 2 = 16
8 x 3 = 24
8 x 4 = 32
8 x 5 = 40
8 x 6 = 48
8 x 7 = 56
8 x 8 = 64
8 x 9 = 72
9 x 1 = 9
9 x 2 = 18
9 x 3 = 27
9 x 4 = 36
9 x 5 = 45
9 x 6 = 54
9 x 7 = 63
9 x 8 = 72
9 x 9 = 81